app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "encounters".* FROM "encounters" WHERE "encounters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("encounter_comment", "user_id", "encounter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["encounter_comment", "great idea!"], ["user_id", 4], ["encounter_id", 1], ["created_at", "2020-05-14 14:34:30.019142"], ["updated_at", "2020-05-14 14:34:30.019142"]]
---
  def create
    @comment = Comment.new(comment_params)
    @user= User.find(params[ :user_id ])
    @encounter= Encounter.find(params[ :encounter_id ])
    @comment.user = @user
    @comment.encounter = @encounter

    if @comment.save