app/controllers/encounters_controller.rb

  def index
    @encounters = Encounter.all
---
SELECT "encounters".* FROM "encounters"

  def show
    @encounter = Encounter.find(params[:id])
---
SELECT "encounters".* FROM "encounters" WHERE "encounters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @encounter = Encounter.new(encounter_params)

    if @encounter.save
---
INSERT INTO "encounters" ("encounter_description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["encounter_description", "1 2 3 "], ["user_id", 4], ["created_at", "2020-05-15 20:05:22.507613"], ["updated_at", "2020-05-15 20:05:22.507613"]]

  def update
    if @encounter.update(encounter_params)
---
UPDATE "encounters" SET "encounter_description" = $1, "updated_at" = $2 WHERE "encounters"."id" = $3  [["encounter_description", "6 7 9"], ["updated_at", "2020-05-15 20:05:29.060536"], ["id", 18]]

  def destroy
    @encounter.destroy
---
DELETE FROM "encounters" WHERE "encounters"."id" = $1  [["id", 17]]

  def add_comment
    @comment = Comment.find(params[:comment_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."encounter_id" = $1  [["encounter_id", 17]]

    def set_encounter
      @encounter = @current_user.encounters.find(params[:id])
---
SELECT "encounters".* FROM "encounters" WHERE "encounters"."user_id" = $1 AND "encounters"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 17], ["LIMIT", 1]]